# DBeam_Get2DObjFOff

## Description
Return the most recently created beam object

```pascal
FUNCTION DBeam_Get2DObjFOff : HANDLE;
```

```python

def vs.DBeam_Get2DObjFOff():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight